#2.
# На вход программы подается 3 целых числа.
# Напишите программу, которая находит серединное значение из этих чисел
#
# a,b,c = 67, 100, 54
# result —> 67

a = int(input('Введите число a: '))
b = int(input('Введите число b: '))
c = int(input('Введите число c: '))

average = (a + b + c) / 3
print(average)



